#Область Корзина

Процедура УстановитьВидимостьКорзины(п_Элементы) Экспорт
	
	Количество = НоменклатураСервер.ПолучитьКоличествоНоменклатурыВКорзине();
	
	Если Количество > 0 Тогда
		п_Элементы.Корзина.Видимость = Истина;
		п_Элементы.Корзина.Заголовок = "Корзина: " + Количество;
	Иначе
		п_Элементы.Корзина.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

Процедура УстановитьИсториюУзлов(п_Форма, Знач п_Узел) Экспорт

	Если п_Узел = п_Форма.ТекущийУзел Тогда
		Возврат;
	КонецЕсли;
	
	Если п_Узел = п_Форма.ТекущийУзел1 Тогда
		Обмен					= п_Форма.ТекущийУзел;
		п_Форма.ТекущийУзел		= п_Форма.ТекущийУзел1;
		п_Форма.ТекущийУзел1	= Обмен;
	Иначе
		п_Форма.ТекущийУзел2	= п_Форма.ТекущийУзел1;
		п_Форма.ТекущийУзел1	= п_Форма.ТекущийУзел;
		п_Форма.ТекущийУзел		= п_Узел;
	КонецЕсли;

КонецПроцедуры
