#Область ПрограммныйИнтерфейс

#Область РегистрСведенийРазмещениеОстатки

// Изменяет размещение номенклатуры в регистре остатков по размещению.
//
// Параметры:
//  п_Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
//  п_РазмещениеНовое - СправочникСсылка.Размещения - новое размещение.
//  п_РазмещениеСтарое - СправочникСсылка.Размещения, Строка - отбор по старому размещению.
//  п_Количество - Число - количество для новой записи размещения.
//
Процедура ИзменитьРазмещение(п_Номенклатура, п_РазмещениеНовое, п_РазмещениеСтарое = "", п_Количество = 1) Экспорт

	НаборЗаписей = РегистрыСведений.ОстаткиПоРазмещению.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Размещение.Установить(п_РазмещениеСтарое);
	НаборЗаписей.Отбор.Номенклатура.Установить(п_Номенклатура);
	НаборЗаписей.Прочитать();

	МЗ = РегистрыСведений.ОстаткиПоРазмещению.СоздатьМенеджерЗаписи();

	Если НаборЗаписей.Количество() > 0 Тогда
		Для Каждого Запись Из НаборЗаписей Цикл
			ЗаполнитьЗначенияСвойств(МЗ, Запись);
			МЗ.Прочитать();
			МЗ.Размещение = п_РазмещениеНовое;
			МЗ.Записать();
		КонецЦикла;
	Иначе
		МЗ.Номенклатура = п_Номенклатура;
		МЗ.Размещение = п_РазмещениеНовое;
		МЗ.Количество = п_Количество;
		МЗ.ДатаСобытия = ТекущаяДатаСеанса();
		МЗ.Записать();
	КонецЕсли;

КонецПроцедуры

// Очищает все размещения номенклатуры в регистре остатков по размещению.
//
// Параметры:
//  п_Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
//
Процедура ОчиститьРазмещения(п_Номенклатура) Экспорт

	НаборЗаписей = РегистрыСведений.ОстаткиПоРазмещению.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(п_Номенклатура);
	НаборЗаписей.Записать();

КонецПроцедуры

// Удаляет размещение номенклатуры из регистра остатков по размещению.
//
// Параметры:
//  п_Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
//  п_Размещение - СправочникСсылка.Размещения - удаляемое размещение.
//
Процедура УдалитьРазмещение(п_Номенклатура, п_Размещение) Экспорт

	МЗ = РегистрыСведений.ОстаткиПоРазмещению.СоздатьМенеджерЗаписи();
	МЗ.Номенклатура = п_Номенклатура;
	МЗ.Размещение = п_Размещение;
	МЗ.Удалить();

КонецПроцедуры

// Возвращает количество номенклатуры по указанному размещению.
//
// Параметры:
//  п_Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
//  п_Размещение - СправочникСсылка.Размещения - размещение.
//
// Возвращаемое значение:
//  Число - количество номенклатуры по размещению.
//
Функция ПолучитьКоличествоПоРазмещению(п_Номенклатура, п_Размещение) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиПоРазмещению.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.ОстаткиПоРазмещению КАК ОстаткиПоРазмещению
		|ГДЕ
		|	ОстаткиПоРазмещению.Номенклатура = &Номенклатура
		|	И ОстаткиПоРазмещению.Размещение = &Размещение";

	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	Запрос.УстановитьПараметр("Размещение", п_Размещение);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;

	Возврат 0;

КонецФункции // ()

// Устанавливает количество номенклатуры по указанному размещению.
//
// Параметры:
//  п_Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
//  п_Размещение - СправочникСсылка.Размещения - размещение.
//  п_Количество - Число - устанавливаемое количество.
//
Процедура УстановитьКоличествоПоРазмещению(п_Номенклатура, п_Размещение, п_Количество) Экспорт

	МЗ = РегистрыСведений.ОстаткиПоРазмещению.СоздатьМенеджерЗаписи();
	МЗ.Номенклатура = п_Номенклатура;
	МЗ.Размещение = п_Размещение;
	МЗ.Количество = п_Количество;
	МЗ.ДатаСобытия = ТекущаяДатаСеанса();
	МЗ.Записать();

КонецПроцедуры // ()

// Возвращает остатки номенклатуры по размещениям.
//
// Параметры:
//  п_Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
//
// Возвращаемое значение:
//  ТаблицаЗначений - остатки номенклатуры по размещениям.
//
Функция ПолучитьОстатки(п_Номенклатура) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиПоРазмещению.Количество КАК Количество,
		|	ОстаткиПоРазмещению.Размещение КАК Размещение
		|ИЗ
		|	РегистрСведений.ОстаткиПоРазмещению КАК ОстаткиПоРазмещению
		|ГДЕ
		|	ОстаткиПоРазмещению.Номенклатура = &Номенклатура";

	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ()

// Возвращает размещения номенклатуры из регистра и справочника размещений.
//
// Параметры:
//  п_Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.Размещения - размещения номенклатуры.
//
Функция ПолучитьРазмещения(п_Номенклатура) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиПоРазмещению.Размещение КАК Размещение
		|ИЗ
		|	РегистрСведений.ОстаткиПоРазмещению КАК ОстаткиПоРазмещению
		|ГДЕ
		|	ОстаткиПоРазмещению.Номенклатура = &Номенклатура";

	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);

	Рез = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Размещение");

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Размещения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Размещения КАК Размещения
		|ГДЕ
		|	Размещения.Номенклатура = &Номенклатура";

	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Если Рез.Найти(Выборка.Ссылка) = Неопределено Тогда
			Рез.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЕсли;

	Возврат Рез;

КонецФункции // ()

// Возвращает код варианта размещения номенклатуры.
//
// Параметры:
//  п_Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
//
// Возвращаемое значение:
//  Число - код варианта размещения: 0 - размещений нет; 1 - одно размещение; 2 - несколько размещений; 3 - есть только в справочнике размещений.
//
Функция ПолучитьНомерРазмещения(п_Номенклатура) Экспорт

	Если НЕ ЗначениеЗаполнено(п_Номенклатура) Тогда
		Возврат 0;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиПоРазмещению.Номенклатура КАК Номенклатура,
		|	ОстаткиПоРазмещению.Размещение КАК Размещение,
		|	ОстаткиПоРазмещению.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.ОстаткиПоРазмещению КАК ОстаткиПоРазмещению
		|ГДЕ
		|	ОстаткиПоРазмещению.Номенклатура = &Номенклатура";

	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	КоличестоМест = Запрос.Выполнить().Выбрать().Количество();

	Рез = 0;

	Если КоличестоМест = 0 Тогда

		Запрос1 = Новый Запрос;
		Запрос1.Текст =
			"ВЫБРАТЬ
			|	Размещения.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Размещения КАК Размещения
			|ГДЕ
			|	Размещения.Номенклатура = &Номенклатура";

		Запрос1.УстановитьПараметр("Номенклатура", п_Номенклатура);

		Выборка1 = Запрос1.Выполнить().Выбрать();

		Если Выборка1.Следующий() Тогда
			Рез = 3; // желтый
		КонецЕсли;

	ИначеЕсли КоличестоМест = 1 Тогда
		Рез = 1; // синий
	Иначе
		Рез = 2; // зеленый
	КонецЕсли;

	Возврат Рез;

КонецФункции // ()

// Возвращает местоположение по размещениям узла или массива узлов.
//
// Параметры:
//  п_Узел - СправочникСсылка.Размещения, Массив из СправочникСсылка.Размещения - узел или массив узлов размещений.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.Местоположения, Строка - местоположение размещений; "Не определено" - если передан неподдерживаемый тип.
//
Функция ПолучитьМестоположениеПоРазмещению(п_Узел) Экспорт

	Если ТипЗнч(п_Узел) = Тип("СправочникСсылка.Размещения") Тогда
		МассивУзлов = Новый Массив;
		МассивУзлов.Добавить(п_Узел);
	ИначеЕсли ТипЗнч(п_Узел) = Тип("Массив") Тогда
		МассивУзлов = п_Узел;
	Иначе
		Возврат "Не определено";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Размещения.Ссылка КАК Размещение,
		|	ВЫБОР
		|		КОГДА Размещения.Ссылка В ИЕРАРХИИ (&УзелДача)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Местоположения.Дача)
		|		КОГДА Размещения.Ссылка В ИЕРАРХИИ (&УзлыДом)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Местоположения.Дом)
		|		КОГДА Размещения.Ссылка В ИЕРАРХИИ (&УзелАвтомобиль)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Местоположения.Автомобиль)
		|		КОГДА Размещения.Ссылка В ИЕРАРХИИ (&УзелВатутинки)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Местоположения.Ватутинки)
		|		КОГДА Размещения.Ссылка В ИЕРАРХИИ (&УзелЧеховМолодежная)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Местоположения.ЧеховМолодежная)
		|		КОГДА Размещения.Ссылка В ИЕРАРХИИ (&УзелАрхив)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Местоположения.Архив)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.Местоположения.Перемещаемое)
		|	КОНЕЦ КАК Местоположение
		|ИЗ
		|	Справочник.Размещения КАК Размещения
		|ГДЕ
		|	Размещения.Ссылка = &Ссылка";

	УзлыДом = Новый Массив;
	УзлыДом.Добавить(Справочники.Размещения.НайтиПоНаименованию("КОМНАТА ГОСТИНАЯ", Истина));
	УзлыДом.Добавить(Справочники.Размещения.НайтиПоНаименованию("КОМНАТА НАША", Истина));
	УзлыДом.Добавить(Справочники.Размещения.НайтиПоНаименованию("КОМНАТА ФЕДОРА", Истина));
	УзлыДом.Добавить(Справочники.Размещения.НайтиПоНаименованию("КУХНЯ", Истина));
	УзлыДом.Добавить(Справочники.Размещения.НайтиПоНаименованию("ЛОДЖИЯ", Истина));
	УзлыДом.Добавить(Справочники.Размещения.НайтиПоНаименованию("ПРИХОЖКА", Истина));

	Запрос.УстановитьПараметр("УзлыДом", УзлыДом);
	Запрос.УстановитьПараметр("УзелДача", Справочники.Размещения.НайтиПоНаименованию("ДАЧА", Истина));
	Запрос.УстановитьПараметр("УзелАвтомобиль", Справочники.Размещения.НайтиПоНаименованию("АВТОМОБИЛЬ", Истина));
	Запрос.УстановитьПараметр("УзелВатутинки", Справочники.Размещения.НайтиПоНаименованию("ВАТУТИНКИ", Истина));
	Запрос.УстановитьПараметр("УзелЧеховМолодежная", Справочники.Размещения.НайтиПоНаименованию("ЧЕХОВ МОЛОДЕЖНАЯ", Истина));
	Запрос.УстановитьПараметр("УзелАрхив", Справочники.Размещения.НайтиПоНаименованию("00 АРХИВ", Истина));

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Размещение", Новый ОписаниеТипов("СправочникСсылка.Размещения"));
	ТЗ.Колонки.Добавить("Местоположение", Новый ОписаниеТипов("ПеречислениеСсылка.Местоположения"));

	Для каждого Узел Из МассивУзлов Цикл

		Запрос.УстановитьПараметр("Ссылка", Узел);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СтрокаТЗ = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, Выборка);
		КонецЕсли;
	КонецЦикла;

	ТЗ.Свернуть("Местоположение");

	Если ТЗ.Количество() > 1 Тогда
		Возврат Перечисления.Местоположения.Несколько;
	ИначеЕсли ТЗ.Количество() = 1 Тогда
		Возврат ТЗ[0].Местоположение;
	Иначе
		Возврат Перечисления.Местоположения.Неопределено;
	КонецЕсли;

КонецФункции // ()

// Проверяет, есть ли у номенклатуры из массива более одного размещения.
//
// Параметры:
//  п_МассивНоменклатура - Массив из СправочникСсылка.Номенклатура - проверяемая номенклатура.
//
// Возвращаемое значение:
//  Булево - Истина, если хотя бы у одной номенклатуры более одного размещения.
//
Функция ПроверитьКоличествоРазмещений(п_МассивНоменклатура) Экспорт

	Для каждого Т Из п_МассивНоменклатура Цикл

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ОстаткиПоРазмещению.Номенклатура КАК Номенклатура,
			|	ОстаткиПоРазмещению.Размещение КАК Размещение,
			|	ОстаткиПоРазмещению.Количество КАК Количество
			|ИЗ
			|	РегистрСведений.ОстаткиПоРазмещению КАК ОстаткиПоРазмещению
			|ГДЕ
			|	ОстаткиПоРазмещению.Номенклатура = &Номенклатура";

		Запрос.УстановитьПараметр("Номенклатура", Т);
		Выборка = Запрос.Выполнить().Выбрать();

		Если Выборка.Количество() > 1 Тогда
			Возврат Истина;
		КонецЕсли;

	КонецЦикла;

	Возврат Ложь;

КонецФункции // ()

// Устанавливает местоположение и вариант размещения в объекте номенклатуры.
//
// Параметры:
//  п_Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
//
Процедура УстановитьВариантРазмещения(п_Номенклатура) Экспорт

	Об = п_Номенклатура.ПолучитьОбъект();

	МассивУзлов = ПолучитьРазмещения(п_Номенклатура);

	Об.Местоположение = ПолучитьМестоположениеПоРазмещению(МассивУзлов);
	Об.ВариантРазмещения = ПолучитьНомерРазмещения(п_Номенклатура);

	Попытка
		Об.Записать();
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

// Устанавливает количество в объекте номенклатуры.
//
// Параметры:
//  п_Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
//  п_Количество - Число - устанавливаемое количество.
//
Процедура УстановитьКоличество(п_Номенклатура, п_Количество) Экспорт

	Об = п_Номенклатура.ПолучитьОбъект();
	Об.Количество = п_Количество;

	Попытка
		Об.Записать();
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область РегистрСведенийЦеныНоменклатуры

// Очищает все цены номенклатуры в регистре цен.
//
// Параметры:
//  п_Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
//
Процедура ОчиститьЦены(п_Номенклатура) Экспорт

	НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(п_Номенклатура);
	НаборЗаписей.Записать();

КонецПроцедуры

// Записывает набор цен номенклатуры в регистр цен.
//
// Параметры:
//  п_Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
//  МассивЦен - Массив из Структура - цены номенклатуры.
//
Процедура УстановитьЦены(п_Номенклатура, МассивЦен) Экспорт

	НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Номенклатура.Установить(п_Номенклатура);

	Для Каждого Т Из МассивЦен Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Т);
		НоваяЗапись.Номенклатура = п_Номенклатура;
	КонецЦикла;

	НаборЗаписей.Записать();

КонецПроцедуры

// Записывает цену номенклатуры по виду цены в регистр цен.
//
// Параметры:
//  п_Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
//  п_Цена - Число - цена.
//  п_ВидЦены - СправочникСсылка.ВидыЦен, Строка - вид цены или его наименование.
//  п_ДатаЦены - Дата - период цены; если не заполнен - текущая дата сеанса.
//
Процедура УстановитьЦену(п_Номенклатура, п_Цена, п_ВидЦены, п_ДатаЦены) Экспорт

	Если ТипЗнч(п_ВидЦены) = Тип("Строка") Тогда
		п_ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию(п_ВидЦены, Истина);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(п_ДатаЦены) Тогда
		п_ДатаЦены = ТекущаяДатаСеанса();
	КонецЕсли;

	МЗ = РегистрыСведений.ЦеныНоменклатуры.СоздатьМенеджерЗаписи();
	МЗ.Период = п_ДатаЦены;
	МЗ.Номенклатура = п_Номенклатура;
	МЗ.ВидЦены = п_ВидЦены;
	МЗ.Цена = п_Цена;

	Попытка
		МЗ.Записать();
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

// Возвращает последнюю цену номенклатуры по виду цены.
//
// Параметры:
//  п_Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
//  п_ВидЦены - Строка - наименование вида цены.
//
// Возвращаемое значение:
//  Структура - цена и дата:
//   * Цена - Число - цена.
//   * Дата - Дата - дата цены.
//
Функция ПолучитьЦену(п_Номенклатура, п_ВидЦены) Экспорт

	Рез = Новый Структура("Цена, Дата", 0, Дата('00010101'));

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Период КАК Дата
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
		|ГДЕ
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
		|	И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";

	Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию(п_ВидЦены, Истина));
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Рез, Выборка);
	КонецЕсли;

	Возврат Рез;

КонецФункции // ()

// Возвращает цены номенклатуры по видам цен "На дату" и "Приобретение".
//
// Параметры:
//  п_Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
//
// Возвращаемое значение:
//  Структура - цены номенклатуры:
//   * ЦенаНаДату - Число - цена по виду цены "На дату".
//   * ЦенаПриобретения - Число - цена по виду цены "Приобретение".
//   * ДатаПриобретения - Дата - дата цены приобретения.
//
Функция ПолучитьЦены(п_Номенклатура) Экспорт

	Рез = Новый Структура("ЦенаНаДату, ЦенаПриобретения, ДатаПриобретения", 0, 0, Дата('00010101'));

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЦеныНоменклатурыСрезПоследних.ВидЦены.Наименование = ""На дату""
		|				ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
		|		КОНЕЦ) КАК ЦенаНаДату,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЦеныНоменклатурыСрезПоследних.ВидЦены.Наименование = ""Приобретение""
		|				ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
		|		КОНЕЦ) КАК ЦенаПриобретения,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЦеныНоменклатурыСрезПоследних.ВидЦены.Наименование = ""Приобретение""
		|				ТОГДА ЦеныНоменклатурыСрезПоследних.Период
		|		КОНЕЦ) КАК ДатаПриобретения
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
		|ГДЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура";

	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Рез, Выборка);
	КонецЕсли;

	Возврат Рез;

КонецФункции // ()

// Возвращает массив цен по массиву номенклатуры.
//
// Параметры:
//  п_МассивНоменклатуры - Массив из СправочникСсылка.Номенклатура - номенклатура.
//
// Возвращаемое значение:
//  Массив из Структура - цены: Период - Дата, Номенклатура - СправочникСсылка.Номенклатура, ВидЦены - СправочникСсылка.ВидыЦен, Цена - Число.
//
Функция ПолучитьМассивЦен(п_МассивНоменклатуры) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныНоменклатуры.Период КАК Период,
		|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатуры.ВидЦены КАК ВидЦены,
		|	ЦеныНоменклатуры.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|ГДЕ
		|	ЦеныНоменклатуры.Номенклатура В(&Номенклатура)";

	Запрос.УстановитьПараметр("Номенклатура", п_МассивНоменклатуры);

	Выборка = Запрос.Выполнить().Выбрать();

	Рез = Новый Массив;

	Пока Выборка.Следующий() Цикл
		СтрокаЦен = Новый Структура;
		СтрокаЦен.Вставить("Период", Выборка.Период);
		СтрокаЦен.Вставить("Номенклатура", Выборка.Номенклатура);
		СтрокаЦен.Вставить("ВидЦены", Выборка.ВидЦены);
		СтрокаЦен.Вставить("Цена", Выборка.Цена);
		Рез.Добавить(СтрокаЦен);
	КонецЦикла;

	Возврат Рез;

КонецФункции // ()

#КонецОбласти

#Область Прочее

// Определяет, является ли элемент справочника размещений группой.
//
// Параметры:
//  п_Элемент - СправочникСсылка.Размещения - элемент справочника размещений.
//
// Возвращаемое значение:
//  Булево - Истина, если элемент является группой.
//
Функция ЭтоГруппа(п_Элемент) Экспорт

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(п_Элемент, "ЭтоГруппа");

КонецФункции // ()

// Возвращает комментарий и место приобретения по массиву номенклатуры.
//
// Параметры:
//  п_МассивНоменклатуры - Массив из СправочникСсылка.Номенклатура - номенклатура.
//
// Возвращаемое значение:
//  Массив из Структура - реквизиты: МестоПриобретения - Строка, Комментарий - Строка.
//
Функция ПолучитьМассивРеквизитов(п_МассивНоменклатуры) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Комментарий КАК Комментарий,
		|	Номенклатура.МестоПриобретения КАК МестоПриобретения
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&Номенклатура)";

	Запрос.УстановитьПараметр("Номенклатура", п_МассивНоменклатуры);

	Выборка = Запрос.Выполнить().Выбрать();

	Рез = Новый Массив;

	Пока Выборка.Следующий() Цикл
		СтрокаРеквизитов = Новый Структура("МестоПриобретения, Комментарий");
		ЗаполнитьЗначенияСвойств(СтрокаРеквизитов, Выборка);
		Рез.Добавить(СтрокаРеквизитов);
	КонецЦикла;

	Возврат Рез;

КонецФункции // ()

// Устанавливает объединённые комментарий и место приобретения в объекте номенклатуры.
//
// Параметры:
//  п_Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
//  п_МассивРеквизитов - Массив из Структура - реквизиты: Комментарий, МестоПриобретения - Строка.
//
Процедура УстановитьРеквизиты(п_Номенклатура, п_МассивРеквизитов) Экспорт

	Рез_Комментарий = "#";
	Рез_МестоПриобретения = "#";

	Для каждого Т Из п_МассивРеквизитов Цикл
		Если СтрНайти(Рез_Комментарий, Т.Комментарий) = 0 Тогда
			Рез_Комментарий = Рез_Комментарий + ", " + Т.Комментарий;
		КонецЕсли;

		Если СтрНайти(Рез_МестоПриобретения, Т.МестоПриобретения) = 0 Тогда
			Рез_МестоПриобретения = Рез_МестоПриобретения + ", " + Т.МестоПриобретения;
		КонецЕсли;
	КонецЦикла;

	Рез_Комментарий = СтрЗаменить(Рез_Комментарий, "#, ", "");
	Рез_МестоПриобретения = СтрЗаменить(Рез_МестоПриобретения, "#, ", "");

	Рез_Комментарий = СтрЗаменить(Рез_Комментарий, "#", "");
	Рез_МестоПриобретения = СтрЗаменить(Рез_МестоПриобретения, "#", "");

	Об = п_Номенклатура.ПолучитьОбъект();
	Об.Комментарий = Рез_Комментарий;
	Об.МестоПриобретения = Рез_МестоПриобретения;

	Попытка
		Об.Записать();
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
