
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПечатьЭтикеток.ВывестиКомандыПечати(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Запись_ЭлементаРазмещения"  Тогда
		Элементы.Список.Обновить();
		ОбновитьОтображениеДанных();
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
	
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		Если Элемент.ТекущиеДанные.Свойство("Ссылка")
			И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Ссылка) Тогда

			ПоказатьКартинку(Элемент.ТекущиеДанные.Ссылка);
			
			ТекРазмещения = НоменклатураСервер.ПолучитьРазмещения(Элемент.ТекущиеДанные.Ссылка);
			
			ОбновитьНадписьРазмещенияВПодвале(ТекРазмещения);
		КонецЕсли; 	
	КонецЕсли; 	

КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура КомандаСписать(Команда)

	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 	

	Если НоменклатураСервер.ЭтоГруппа(Элементы.Список.ТекущаяСтрока) Тогда
		Возврат;
	КонецЕсли;
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", Элементы.Список.ТекущаяСтрока);
	
	Обработчик = Новый ОписаниеОповещения("ОбработатьДокументСписания", ЭтотОбъект);
	
	ОткрытьФорму("Документ.Списание.ФормаОбъекта", ПараметрыФормы,,,,,Обработчик);

КонецПроцедуры

&НаКлиенте
Асинх Процедура Объединить(Команда)

    МассивСтрок = Элементы.Список.ВыделенныеСтроки;

	Если МассивСтрок.Количество() = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ОдинаковыеНаименования = ПроверитьОдинаковостьНаименований(МассивСтрок);
	
	Если НЕ ОдинаковыеНаименования Тогда
		ПредупреждениеАсинх("Строки разных наименований", 1);
		Возврат;
	КонецЕсли;
	
	Обещание = ВопросАсинх("Выполнить объединение?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	Рез = Ждать Обещание;
	
	Если Рез = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;	
	
	МассивРазмещений = Новый Массив;
	Для каждого Номенклатура Из МассивСтрок Цикл
		Если НоменклатураСервер.ЭтоГруппа(Номенклатура)  Тогда
			Продолжить;
		КонецЕсли;
		РазмещенияЭлемента = НоменклатураСервер.ПолучитьРазмещения(Номенклатура);
		Для каждого РазмещениеЭлемента Из РазмещенияЭлемента Цикл
			Если МассивРазмещений.Найти(РазмещениеЭлемента) = Неопределено Тогда
				УзелКоличество = Новый Структура();
				УзелКоличество.Вставить("Узел", РазмещениеЭлемента);
				УзелКоличество.Вставить("Количество", НоменклатураСервер.ПолучитьКоличествоПоРазмещению(Номенклатура, РазмещениеЭлемента));
				МассивРазмещений.Добавить(УзелКоличество);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	
	МассивЦен = НоменклатураСервер.ПолучитьМассивЦен(МассивСтрок);

	МассивРеквизитов = НоменклатураСервер.ПолучитьМассивРеквизитов(МассивСтрок);
	
	Номенклатура_0 = МассивСтрок[0];
	
	НоменклатураСервер.ОчиститьРазмещения(Номенклатура_0);
	
	КоличествоИтого = 0;
	Для каждого М Из МассивРазмещений Цикл
		НоменклатураСервер.ИзменитьРазмещение(Номенклатура_0, М.Узел,,М.Количество);
		КоличествоИтого = КоличествоИтого + М.Количество;
	КонецЦикла;
	
	Для Т = 1 По МассивСтрок.Количество()-1 Цикл
		Элемент = МассивСтрок[Т];
		НоменклатураСервер.ОчиститьРазмещения(Элемент);
		НоменклатураСервер.ОчиститьЦены(Элемент);
		УдалитьЭлемент(Элемент);
	КонецЦикла;

	НоменклатураСервер.УстановитьРеквизиты(Номенклатура_0, МассивРеквизитов);
	НоменклатураСервер.УстановитьЦены(Номенклатура_0, МассивЦен);
	НоменклатураСервер.УстановитьВариантРазмещения(Номенклатура_0);
	НоменклатураСервер.УстановитьКоличество(Номенклатура_0, КоличествоИтого);

	Элементы.Список.Обновить();
	
	РазмещенияЭлемента = НоменклатураСервер.ПолучитьРазмещения(Номенклатура_0);

	ОбновитьНадписьРазмещенияВПодвале(РазмещенияЭлемента);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРазмещение(Команда)

	Парам = Новый Структура;

	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено Тогда
		УзлыРазмещения = НоменклатураСервер.ПолучитьРазмещения(ТекСтрока);
	КонецЕсли;

	Если УзлыРазмещения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Парам.Вставить("ТекущийУзел", УзлыРазмещения);
	
	ФормаРазмещения = Неопределено;
	ОкнаПриложения = ПолучитьОкна();
	Для каждого ОкноПриложения Из ОкнаПриложения Цикл
		Если ОкноПриложения.Заголовок = "Начальная страница" Тогда
			ФормаРазмещения = ОкноПриложения.Содержимое[1].ЭтаФорма;
		КонецЕсли;
	КонецЦикла;	

	Если ФормаРазмещения = Неопределено Тогда
		ФормаРазмещения = ПолучитьФорму("Справочник.Номенклатура.Форма.ПоРазмещению");
	КонецЕсли;	
	
	Если ФормаРазмещения.Открыта() Тогда
		НоменклатураКлиент.УстановитьИсториюУзлов(ФормаРазмещения, УзлыРазмещения[0]);
		ФормаРазмещения.УстановитьМассивУзловРазмещения(УзлыРазмещения);
		ФормаРазмещения.Открыть();
	Иначе	
	    ФормаРазмещения = Неопределено;
		ОткрытьФорму("Справочник.Номенклатура.Форма.ПоРазмещению", Парам);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Переместить(Команда)

	ФормаРазмещения = Неопределено;
	ОкнаПриложения = ПолучитьОкна();
	Для каждого ОкноПриложения Из ОкнаПриложения Цикл
		Если ОкноПриложения.Заголовок = "Начальная страница" Тогда
			ФормаРазмещения = ОкноПриложения.Содержимое[1].ЭтаФорма;
		КонецЕсли;
	КонецЦикла;	

	Если ФормаРазмещения = Неопределено Тогда
		Возврат;
	КонецЕсли;	

	Рез = ФормаРазмещения.ПолучитьТекущуюСтроку();
	
	ЦелевойУзел = "";
	Если ЗначениеЗаполнено(Рез.Размещение) Тогда
		ЦелевойУзел = Рез.Размещение;
	ИначеЕсли ЗначениеЗаполнено(Рез.Номенклатура) Тогда
		РодительЭлементаДерева = ФормаРазмещения.ПолучитьРодителяЭлементаДерева();
		Если РодительЭлементаДерева <> Неопределено Тогда
			ЦелевойУзел = РодительЭлементаДерева.Размещение;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЦелевойУзел) 
		ИЛИ НоменклатураСервер.ЭтоГруппа(ЦелевойУзел) Тогда
		Возврат;
	КонецЕсли;

    МассивСтрок = Элементы.Список.ВыделенныеСтроки;

	НесколькоРазмещений = НоменклатураСервер.ПроверитьКоличествоРазмещений(МассивСтрок);
	Если НесколькоРазмещений Тогда
		Сообщить("Отказ, есть несколько размещений");
		Возврат;
	КонецЕсли; 
	
	Рез = НоменклатураПеремещение(МассивСтрок, ЦелевойУзел);
	
	Парам = Новый Структура();
	Парам.Вставить("Ключ", ЦелевойУзел);
	Если НоменклатураСервер.ЭтоГруппа(ЦелевойУзел) Тогда
		Оповестить("Запись_ГруппыРазмещения", Парам, ЭтотОбъект);
	Иначе
		Оповестить("Запись_ЭлементаРазмещения", Парам, ЭтотОбъект);
	КонецЕсли;

	ТекРазмещения = Новый Массив;
	ТекРазмещения.Добавить(ЦелевойУзел);
	ОбновитьНадписьРазмещенияВПодвале(ТекРазмещения);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаРазмещениями

Функция ПолучитьУзелРазмещения(п_Номенклатура)

КонецФункции // ()

Функция НоменклатураПеремещение(п_МассивСтрок, п_ЦелевойУзел)

	Для каждого Т Из п_МассивСтрок Цикл

		Если Т.ЭтоГруппа Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если Т.ВариантРазмещения = 3 Тогда
			Возврат Ложь;
		КонецЕсли;

		МассивМест = НоменклатураСервер.ПолучитьРазмещения(Т);
		
		Если МассивМест.Количество() > 1 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если МассивМест.Количество() = 0 Тогда
			НоменклатураСервер.ИзменитьРазмещение(Т, п_ЦелевойУзел,, Т.Количество); // начальное размещение
		Иначе
			НоменклатураСервер.ИзменитьРазмещение(Т, п_ЦелевойУзел, МассивМест[0], Т.Количество); // перемещение
		КонецЕсли;

		НоменклатураСервер.УстановитьВариантРазмещения(Т);
		
	КонецЦикла;

	Возврат Истина;
	
КонецФункции

Функция ПроверитьОдинаковостьНаименований(п_МассиНоменклатуры)
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	Для каждого Т Из п_МассиНоменклатуры Цикл
		СтрокаТЗ = ТЗ.Добавить();
		СтрокаТЗ.Наименование = Т.Наименование;
	КонецЦикла;

	ТЗ.Свернуть("Наименование");
	
	Возврат ТЗ.Количество() <= 1;

КонецФункции // ()

Процедура УдалитьЭлемент(п_Номенклатура)
	
	п_Номенклатура.ПолучитьОбъект().УстановитьПометкуУдаления(Истина, Истина);

КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаКлиенте
Процедура ОбработатьДокументСписания(П1, П2) Экспорт

	Если П1 <> Неопределено Тогда
		Элементы.Список.Обновить();
		ОбновитьОтображениеДанных();
	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьНадписьРазмещенияВПодвале(п_МассивУзлов)
	
	Если п_МассивУзлов.Количество() = 0 Тогда
		РазмещениеПодвал = "Нет";
	ИначеЕсли п_МассивУзлов.Количество() = 1 Тогда
		РазмещениеПодвал = п_МассивУзлов[0].ПолноеНаименование();
	Иначе
		РазмещениеПодвал = "Несколько";
	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

#Область Печать

Процедура УстановитьКартинкуКоманды(п_КомандаИмя)

	ПечатьЭтикеток.УстановитьКартинкуКоманды(ЭтотОбъект, п_КомандаИмя);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Напечатать(Команда)

	КомандаИзменена = ПечатьЭтикеток.ВыделитьКомандуПечати(Команда.Имя);
	
	Если КомандаИзменена Тогда
		УстановитьКартинкуКоманды(Команда.Имя);
	КонецЕсли;

	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	
	ТабДок = ПечатьЭтикеток.ПечатьЭтикетки50х30(МассивСтрок, Команда.Имя);
	ТабДок.Показать();

КонецПроцедуры

#КонецОбласти

#Область Картинки

&НаСервереБезКонтекста
Функция НавигационнаяСсылкаКартинки(ФайлКартинки, ИдентификаторФормы)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		АдресКартинки = РаботаСФайлами.ДанныеФайла(ФайлКартинки, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		АдресКартинки = "";
	КонецПопытки;
	
	Возврат АдресКартинки;
	
КонецФункции

Процедура ПоказатьКартинку(п_Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураПрисоединенныеФайлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
		|ГДЕ
		|	НоменклатураПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
		|	И НЕ НоменклатураПрисоединенныеФайлы.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	НоменклатураПрисоединенныеФайлы.ДатаСоздания";
	
	Запрос.УстановитьПараметр("ВладелецФайла", п_Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Элементы.СтраницыИзображения.ТекущаяСтраница = Элементы.СтраницаИзображения1;
		Если Выборка.Следующий() Тогда
			СсылкаНаКартинку = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		КонецЕсли;
		СсылкаНаКартинку2 = "";
		СсылкаНаКартинку3 = "";
		СсылкаНаКартинку4 = "";
	ИначеЕсли Выборка.Количество() = 2 Тогда
		Элементы.СтраницыИзображения.ТекущаяСтраница = Элементы.СтраницаИзображения2;
		Выборка.Следующий();
		СсылкаНаКартинку = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		Выборка.Следующий();
		СсылкаНаКартинку2 = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		СсылкаНаКартинку3 = "";
		СсылкаНаКартинку4 = "";
	ИначеЕсли Выборка.Количество() = 3 Тогда
		Элементы.СтраницыИзображения.ТекущаяСтраница = Элементы.СтраницаИзображения4;
		Выборка.Следующий();
		СсылкаНаКартинку = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		Выборка.Следующий();
		СсылкаНаКартинку2 = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		Выборка.Следующий();
		СсылкаНаКартинку3 = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		СсылкаНаКартинку4 = "";
	ИначеЕсли Выборка.Количество() >= 4 Тогда
		Элементы.СтраницыИзображения.ТекущаяСтраница = Элементы.СтраницаИзображения4;
		Выборка.Следующий();
		СсылкаНаКартинку = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		Выборка.Следующий();
		СсылкаНаКартинку2 = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		Выборка.Следующий();
		СсылкаНаКартинку3 = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		Выборка.Следующий();
		СсылкаНаКартинку4 = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
	Иначе		
		Элементы.СтраницыИзображения.ТекущаяСтраница = Элементы.СтраницаИзображения1;
		СсылкаНаКартинку = "";
		СсылкаНаКартинку2 = "";
		СсылкаНаКартинку3 = "";
		СсылкаНаКартинку4 = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти