
&НаСервере
Процедура ВыполнитьИсправлениеРазмещенияНаСервере()

	ГруппаАрхив = Справочники.Номенклатура.НайтиПоНаименованию("00 АРХИВ", Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Местоположение КАК Местоположение,
		|	Номенклатура.ВариантРазмещения КАК ВариантРазмещения
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл

		ВариантРазмещения = НоменклатураСервер.ПолучитьНомерРазмещения(Выборка.Ссылка);
		
		Если Выборка.ВариантРазмещения <> ВариантРазмещения Тогда
			Сообщить("Вариант размещения: " + Выборка.Ссылка +", "+ Выборка.ВариантРазмещения + ",  " + ВариантРазмещения);
		КонецЕсли;
		//ТекущийОбъект.ВариантРазмещения = ВариантРазмещения;

		МассивМест = НоменклатураСервер.ПолучитьРазмещения(Выборка.Ссылка);

		Если МассивМест.Количество() > 0 Тогда
			Местоположение = НоменклатураСервер.ПолучитьМестоположениеПоРазмещению(МассивМест);
		ИначеЕсли Выборка.Ссылка.ПринадлежитЭлементу(ГруппаАрхив) Тогда
			Местоположение = Перечисления.Местоположения.Архив;
		КонецЕсли;
		
		Если Выборка.ВариантРазмещения <> ВариантРазмещения Тогда
			Сообщить("Местоположение: " + Выборка.Ссылка +", "+ Выборка.Местоположение + ",  " + Местоположение);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИсправлениеРазмещения(Команда)
	ВыполнитьИсправлениеРазмещенияНаСервере();
КонецПроцедуры
