

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Для каждого Т Из Товары Цикл
		
		КоличествоПоРазмещению = НоменклатураСервер.ПолучитьКоличествоПоРазмещению(Номенклатура, Т.Размещение);
		
		Если Т.Количество > КоличествоПоРазмещению Тогда
			//Сообщить("Количество по размещению меньше, чем требуется списать: " + Т.Размещение + ", остаток: " + КоличествоПоРазмещению);
			//Отказ = Истина;
			Возврат;
		ИначеЕсли Т.Количество < КоличествоПоРазмещению Тогда	
			Списать = КоличествоПоРазмещению - Т.Количество;
			НоменклатураСервер.УстановитьКоличествоПоРазмещению(Номенклатура, Т.Размещение, Списать);
		Иначе	
			НоменклатураСервер.УдалитьРазмещение(Номенклатура, Т.Размещение);
		КонецЕсли;
		
	КонецЦикла;
	
	ТЗ_Остатки = НоменклатураСервер.ПолучитьОстатки(Номенклатура);
	НовоеКоличество = ТЗ_Остатки.Итог("Количество");
	
	НоменклатураСервер.УстановитьКоличество(Номенклатура, НовоеКоличество);
	
	Если НовоеКоличество = 0 Тогда
		Об = Номенклатура.ПолучитьОбъект();
		Об.Родитель				= НоменклатураАрхив;
		Об.ВариантРазмещения	= 0;
		Об.Местоположение		= Перечисления.Местоположения.Архив;
		Попытка
			Об.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;

	Движения.Списание.Записывать = Истина;
	Для Каждого Т Из Товары Цикл
		Движение = Движения.Списание.Добавить();
		Движение.Период			= Дата;
		Движение.Номенклатура	= Номенклатура;
		Движение.Размещение		= Т.Размещение;
		Движение.Количество		= Т.Количество;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)




КонецПроцедуры

#КонецОбласти
