
#Область ОбработчикСобытийФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Номенклатура") Тогда

		Объект.Номенклатура = Параметры.Номенклатура;
		
		ТЗ = НоменклатураСервер.ПолучитьОстатки(Параметры.Номенклатура);
		
		Для каждого Т Из ТЗ Цикл
			ЗаполнитьЗначенияСвойств(Объект.Товары.Добавить(), Т);
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.НоменклатураАрхив = Справочники.Номенклатура.НайтиПоНаименованию("00 Архив", Истина);
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы
	
&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаДвиженияДокумента(Команда)

	ЗначениеОтбора = Новый Структура("Регистратор", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);

	ОткрытьФорму("РегистрНакопления.Списание.ФормаСписка", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ПараметрыЗаписи = Новый Структура;
    ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);	
	
	Записать(ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ПараметрыЗаписи = Новый Структура;
    ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);	
	
	Записать(ПараметрыЗаписи);
	
	Закрыть("Закрыт");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура КомандаЗаполнитьНаСервере()

	Объект.Товары.Очистить();
	
	ТЗ = НоменклатураСервер.ПолучитьОстатки(Объект.Номенклатура);
		
	Для каждого Т Из ТЗ Цикл
		ЗаполнитьЗначенияСвойств(Объект.Товары.Добавить(), Т);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

