
#Область ОбработчикиСобытийФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами 
	
	ПечатьЭтикеток.ВывестиКомандыПечати(ЭтотОбъект);

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Количество = 1;
		Объект.Местоположение = Перечисления.Местоположения.Неопределено;
	Иначе
		СтрукЦены = НоменклатураСервер.ПолучитьЦены(Объект.Ссылка);
		ЦенаАктуальная		= СтрукЦены.ЦенаНаДату;
		ЦенаПриобретения	= СтрукЦены.ЦенаПриобретения;
		ДатаПриобретения	= СтрукЦены.ДатаПриобретения;

		ЗаполнитьТаблицуКартинок(Объект.Ссылка);
	КонецЕсли;

	ЭлементОтбора = СписокРазмещение.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьКартинку();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);

	ЗаполнитьТаблицуКартинок(Объект.Ссылка);

	ПоказатьКартинку();

КонецПроцедуры

Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ВариантРазмещения = НоменклатураСервер.ПолучитьНомерРазмещения(ТекущийОбъект.Ссылка);
	ТекущийОбъект.ВариантРазмещения = ВариантРазмещения;

	МассивМест = НоменклатураСервер.ПолучитьРазмещения(ТекущийОбъект.Ссылка);
	
	ГруппаАрхив = Справочники.Номенклатура.НайтиПоНаименованию("00 АРХИВ", Истина);

	Если МассивМест.Количество() > 0 Тогда
		ТекущийОбъект.Местоположение = НоменклатураСервер.ПолучитьМестоположениеПоРазмещению(МассивМест);
	ИначеЕсли ТекущийОбъект.ПринадлежитЭлементу(ГруппаАрхив) Тогда
		ТекущийОбъект.Местоположение = Перечисления.Местоположения.Архив;
	КонецЕсли;
	
	Если ВариантРазмещения = 3 Тогда
		Возврат; // в косвенном размещении нет кол-ва
	КонецЕсли;
	
	Если МассивМест.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьСвободныеКомпоненты = Ложь;
	КоличествоПоМестам = 0;
	Для каждого Т Из МассивМест Цикл
		Кол = НоменклатураСервер.ПолучитьКоличествоПоРазмещению(ТекущийОбъект.Ссылка, Т);
		КоличествоПоМестам = КоличествоПоМестам + Кол;
		Если НЕ Т.КомпьютернаяСборка Тогда
			ЕстьСвободныеКомпоненты = Истина;
		КонецЕсли;
	КонецЦикла;

	Если ТекущийОбъект.КомпьютернаяСборкаКомпонент Тогда
		ТекущийОбъект.КомпьютернаяСборкаЕстьСвободные = ЕстьСвободныеКомпоненты;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если КоличествоПоМестам <> ТекущийОбъект.Количество Тогда
			Сообщить("Кол-во в карточке не совпадает с количеством по местам");
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ОтложеннаяЗаписьЦен Тогда

		Если ЗначениеЗаполнено(ЦенаПриобретения) Тогда
			НоменклатураСервер.УстановитьЦену(ТекущийОбъект.Ссылка, ЦенаПриобретения, "Приобретение", ДатаПриобретения);
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(ЦенаАктуальная) Тогда
			НоменклатураСервер.УстановитьЦену(ТекущийОбъект.Ссылка, ЦенаПриобретения, "На дату", ДатаПриобретения);
		КонецЕсли;		

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ПараметрыЗаписи.Вставить("Ключ", Объект.Ссылка);
	
	Оповестить("Запись_Номенклатура", ПараметрыЗаписи, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НаименованиеДляПечати(Команда)
	Объект.НаименованиеДляПечати = Объект.Наименование;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИсторияЦен(Команда)
	
	ПараметрыОтбора = Новый Структура("Номенклатура", Объект.Ссылка);
	
	ОткрытьФорму("РегистрСведений.ЦеныНоменклатуры.ФормаСписка", Новый Структура("Отбор", ПараметрыОтбора));

КонецПроцедуры

&НаКлиенте
Процедура ЦенаАктуальнаяУстановить(Команда)

	Если ЦенаАктуальная = 0 Тогда
		Возврат;
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОтложеннаяЗаписьЦен = Истина;
		Возврат;
	КонецЕсли;

	ЦенаБазыДанных = НоменклатураСервер.ПолучитьЦену(Объект.Ссылка, "На дату").Цена;
	
	Если ЦенаБазыДанных = ЦенаАктуальная Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Цена не изменилась";
		Сообщение.Поле = "ЦенаАктуальная";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	НоменклатураСервер.УстановитьЦену(Объект.Ссылка, ЦенаАктуальная, "На дату", ДатаПриобретения);
	ПоказатьОповещениеПользователя("Цена установлена");

КонецПроцедуры

&НаКлиенте
Процедура СайтПерейти(Команда)

	Если ЗначениеЗаполнено(Объект.Сайт) Тогда
		ПерейтиПоНавигационнойСсылке(Объект.Сайт);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьРазмещение(Команда)
	
	П = Новый Структура;
	П.Вставить("Номенклатура", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.ОстаткиПоРазмещению.ФормаЗаписи", П);

КонецПроцедуры

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	 РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокРазмещениеПриАктивизацииСтроки(Элемент)

	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекРазмещение = Элемент.ТекущиеДанные.Размещение;

	ОбновитьНадписьРазмещенияВПодвале(ТекРазмещение);

КонецПроцедуры

&НаКлиенте
Процедура ЦенаАктуальнаяПриИзменении(Элемент)
	
	Если ЦенаАктуальная = 0 Тогда
		Возврат;
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОтложеннаяЗаписьЦен = Истина;
		Возврат;
	КонецЕсли;
	
	ЦенаБазыДанных = НоменклатураСервер.ПолучитьЦену(Объект.Ссылка, "На дату").Цена;
	
	Если ЦенаБазыДанных = ЦенаАктуальная Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Цена не изменилась";
		Сообщение.Поле = "ЦенаАктуальная";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	НоменклатураСервер.УстановитьЦену(Объект.Ссылка, ЦенаАктуальная, "На дату", ДатаПриобретения);
	ПоказатьОповещениеПользователя("Цена установлена");

КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриобретеняПриИзменении(Элемент)

	Если ЦенаПриобретения = 0 Тогда
		Возврат;
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОтложеннаяЗаписьЦен = Истина;
		Возврат;
	КонецЕсли;

	ЦенаБазыДанных = НоменклатураСервер.ПолучитьЦену(Объект.Ссылка, "Приобретение").Цена;
	
	Если ЦенаБазыДанных = ЦенаПриобретения Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Цена не изменилась";
		Сообщение.Поле = "ЦенаПриобретения";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	НоменклатураСервер.УстановитьЦену(Объект.Ссылка, ЦенаПриобретения, "Приобретение", ДатаПриобретения);
	ПоказатьОповещениеПользователя("Цена установлена");

КонецПроцедуры
	
#КонецОбласти

#Область Картинки

&НаСервереБезКонтекста
Функция НавигационнаяСсылкаКартинки(ФайлКартинки, ИдентификаторФормы)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		АдресКартинки = РаботаСФайлами.ДанныеФайла(ФайлКартинки, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		АдресКартинки = "";
	КонецПопытки;
	
	Возврат АдресКартинки;
	
КонецФункции

Процедура ПоказатьКартинку()

    Если ТаблицаКартинок.Количество() > 0 Тогда
		СсылкаНаКартинку = ТаблицаКартинок[СчетчикКартинок].НавигационнаяСсылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуКартинок(п_Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураПрисоединенныеФайлы.Ссылка КАК Файл
		|ИЗ
		|	Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
		|ГДЕ
		|	НоменклатураПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
		|	И НЕ НоменклатураПрисоединенныеФайлы.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	НоменклатураПрисоединенныеФайлы.ДатаСоздания";
	
	Запрос.УстановитьПараметр("ВладелецФайла", п_Номенклатура);
	
	Таб = Запрос.Выполнить().Выгрузить();
	ТаблицаКартинок.Загрузить(Таб);
	Для каждого Т Из ТаблицаКартинок Цикл
		Т.НавигационнаяСсылка = НавигационнаяСсылкаКартинки(Т.Файл, УникальныйИдентификатор);
	КонецЦикла;
	
	Элементы.УправлениеКартинками.Видимость = ТаблицаКартинок.Количество() > 1;
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаСледующая(Команда)

	Если ТаблицаКартинок.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;

	СчетчикКартинок = СчетчикКартинок + 1;
	Если СчетчикКартинок = ТаблицаКартинок.Количество() Тогда
		СчетчикКартинок = 0; 
	КонецЕсли;

	СсылкаНаКартинку = ТаблицаКартинок[СчетчикКартинок].НавигационнаяСсылка;
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаПредыдущая(Команда)

	Если ТаблицаКартинок.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;

	СчетчикКартинок = СчетчикКартинок - 1;
	Если СчетчикКартинок < 0 Тогда
		СчетчикКартинок = ТаблицаКартинок.Количество() - 1; 
	КонецЕсли;

	СсылкаНаКартинку = ТаблицаКартинок[СчетчикКартинок].НавигационнаяСсылка;

КонецПроцедуры

#КонецОбласти

#Область Печать

Процедура УстановитьКартинкуКоманды(п_КомандаИмя)

	ПечатьЭтикеток.УстановитьКартинкуКоманды(ЭтотОбъект, п_КомандаИмя);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Напечатать(Команда)

	КомандаИзменена = ПечатьЭтикеток.ВыделитьКомандуПечати(Команда.Имя);
	
	Если КомандаИзменена Тогда
		УстановитьКартинкуКоманды(Команда.Имя);
	КонецЕсли;
	
	П = Новый Массив;
	П.Добавить(Объект.Ссылка);
	
	ТабДок = ПечатьЭтикеток.ПечатьЭтикетки50х30(П, Команда.Имя);
	ТабДок.Показать();

КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура ОбновитьНадписьРазмещенияВПодвале(п_Узел)
	
	РазмещениеПодвал = п_Узел.ПолноеНаименование();

КонецПроцедуры

#КонецОбласти	
